; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_13_20)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 - boat
		p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 - person
	)

  (:init
		(= (x b0) -2)
(= (y b0) 0)
(= (x b1) 10)
(= (y b1) 0)
(= (x b2) -4)
(= (y b2) 0)
(= (x b3) -9)
(= (y b3) 0)
(= (x b4) 2)
(= (y b4) 0)
(= (x b5) -9)
(= (y b5) 0)
(= (x b6) -2)
(= (y b6) 0)
(= (x b7) 5)
(= (y b7) 0)
(= (x b8) 5)
(= (y b8) 0)
(= (x b9) 0)
(= (y b9) 0)
(= (x b10) -6)
(= (y b10) 0)
(= (x b11) -10)
(= (y b11) 0)
(= (x b12) 9)
(= (y b12) 0)

		(= (d p0) 68)
(= (d p1) 100)
(= (d p2) 65)
(= (d p3) 89)
(= (d p4) 6)
(= (d p5) 73)
(= (d p6) 26)
(= (d p7) 68)
(= (d p8) 82)
(= (d p9) 38)
(= (d p10) 94)
(= (d p11) 25)
(= (d p12) 20)
(= (d p13) 80)
(= (d p14) 38)
(= (d p15) 42)
(= (d p16) 19)
(= (d p17) 17)
(= (d p18) 20)
(= (d p19) 40)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
(saved p6)
(saved p7)
(saved p8)
(saved p9)
(saved p10)
(saved p11)
(saved p12)
(saved p13)
(saved p14)
(saved p15)
(saved p16)
(saved p17)
(saved p18)
(saved p19)
		)
	)
)

; plan
1. (go_north_east b9)
   changed: (x b9) from 0 to 1.5, (y b9) from 0 to 1.5
   goals met: 0 of 20
2. (go_north_east b9)
   changed: (x b9) from 1.5 to 3, (y b9) from 1.5 to 3
   goals met: 0 of 20
3. (go_north_east b9)
   changed: (x b9) from 3 to 4.5, (y b9) from 3 to 4.5
   goals met: 0 of 20
4. (go_north_east b9)
   changed: (x b9) from 4.5 to 6, (y b9) from 4.5 to 6
   goals met: 0 of 20
5. (go_north_east b9)
   changed: (x b9) from 6 to 7.5, (y b9) from 6 to 7.5
   goals met: 0 of 20
6. (go_north_east b9)
   changed: (x b9) from 7.5 to 9, (y b9) from 7.5 to 9
   goals met: 0 of 20
7. (go_north_east b9)
   changed: (x b9) from 9 to 10.5, (y b9) from 9 to 10.5
   goals met: 0 of 20
8. (go_north_east b9)
   changed: (x b9) from 10.5 to 12, (y b9) from 10.5 to 12
   goals met: 0 of 20
9. (go_north_east b9)
   changed: (x b9) from 12 to 13.5, (y b9) from 12 to 13.5
   goals met: 0 of 20
10. (go_north_east b9)
   changed: (x b9) from 13.5 to 15, (y b9) from 13.5 to 15
   goals met: 0 of 20
11. (go_north_east b9)
   changed: (x b9) from 15 to 16.5, (y b9) from 15 to 16.5
   goals met: 0 of 20
12. (go_north_east b9)
   changed: (x b9) from 16.5 to 18, (y b9) from 16.5 to 18
   goals met: 0 of 20
13. (go_north_east b9)
   changed: (x b9) from 18 to 19.5, (y b9) from 18 to 19.5
   goals met: 0 of 20
14. (go_north_west b9)
   changed: (x b9) from 19.5 to 18, (y b9) from 19.5 to 21
   goals met: 0 of 20
15. (go_north_west b9)
   changed: (x b9) from 18 to 16.5, (y b9) from 21 to 22.5
   goals met: 0 of 20
16. (go_west b9)
   changed: (x b9) from 16.5 to 13.5
   goals met: 0 of 20
17. (go_west b9)
   changed: (x b9) from 13.5 to 10.5
   goals met: 0 of 20
18. (go_west b9)
   changed: (x b9) from 10.5 to 7.5
   goals met: 0 of 20
19. (go_west b9)
   changed: (x b9) from 7.5 to 4.5
   goals met: 0 of 20
20. (go_north_east b9)
   changed: (x b9) from 4.5 to 6, (y b9) from 22.5 to 24
   goals met: 0 of 20
21. (go_north_east b9)
   changed: (x b9) from 6 to 7.5, (y b9) from 24 to 25.5
   goals met: 0 of 20
22. (go_north_east b9)
   changed: (x b9) from 7.5 to 9, (y b9) from 25.5 to 27
   goals met: 0 of 20
23. (go_north_east b9)
   changed: (x b9) from 9 to 10.5, (y b9) from 27 to 28.5
   goals met: 0 of 20
24. (save_person b9 p17)
   added: (saved p17)
   goals met: 1 of 20
25. (go_north_west b9)
   changed: (x b9) from 10.5 to 9, (y b9) from 28.5 to 30
   goals met: 1 of 20
26. (save_person b9 p12)
   added: (saved p12)
   goals met: 2 of 20
27. (save_person b9 p16)
   added: (saved p16)
   goals met: 3 of 20
28. (save_person b9 p18)
   added: (saved p18)
   goals met: 4 of 20
29. (go_north_west b9)
   changed: (x b9) from 9 to 7.5, (y b9) from 30 to 31.5
   goals met: 4 of 20
30. (go_north_west b9)
   changed: (x b9) from 7.5 to 6, (y b9) from 31.5 to 33
   goals met: 4 of 20
31. (save_person b9 p6)
   added: (saved p6)
   goals met: 5 of 20
32. (save_person b9 p11)
   added: (saved p11)
   goals met: 6 of 20
33. (go_north_west b9)
   changed: (x b9) from 6 to 4.5, (y b9) from 33 to 34.5
   goals met: 6 of 20
34. (go_north_west b9)
   changed: (x b9) from 4.5 to 3, (y b9) from 34.5 to 36
   goals met: 6 of 20
35. (go_south b9)
   changed: (y b9) from 36 to 34
   goals met: 6 of 20
36. (go_north_east b9)
   changed: (x b9) from 3 to 4.5, (y b9) from 34 to 35.5
   goals met: 6 of 20
37. (go_north_west b9)
   changed: (x b9) from 4.5 to 3, (y b9) from 35.5 to 37
   goals met: 6 of 20
38. (go_north_east b9)
   changed: (x b9) from 3 to 4.5, (y b9) from 37 to 38.5
   goals met: 6 of 20
39. (go_north_east b9)
   changed: (x b9) from 4.5 to 6, (y b9) from 38.5 to 40
   goals met: 6 of 20
40. (go_north_east b9)
   changed: (x b9) from 6 to 7.5, (y b9) from 40 to 41.5
   goals met: 6 of 20
41. (go_north_east b9)
   changed: (x b9) from 7.5 to 9, (y b9) from 41.5 to 43
   goals met: 6 of 20
42. (go_north_east b9)
   changed: (x b9) from 9 to 10.5, (y b9) from 43 to 44.5
   goals met: 6 of 20
43. (go_north_east b9)
   changed: (x b9) from 10.5 to 12, (y b9) from 44.5 to 46
   goals met: 6 of 20
44. (go_north_east b9)
   changed: (x b9) from 12 to 13.5, (y b9) from 46 to 47.5
   goals met: 6 of 20
45. (go_north_east b9)
   changed: (x b9) from 13.5 to 15, (y b9) from 47.5 to 49
   goals met: 6 of 20
46. (go_north_east b9)
   changed: (x b9) from 15 to 16.5, (y b9) from 49 to 50.5
   goals met: 6 of 20
47. (go_north_east b4)
   changed: (x b4) from 2 to 3.5, (y b4) from 0 to 1.5
   goals met: 6 of 20
48. (go_north_east b4)
   changed: (x b4) from 3.5 to 5, (y b4) from 1.5 to 3
   goals met: 6 of 20
49. (go_north_west b9)
   changed: (x b9) from 16.5 to 15, (y b9) from 50.5 to 52
   goals met: 6 of 20
50. (go_north_west b9)
   changed: (x b9) from 15 to 13.5, (y b9) from 52 to 53.5
   goals met: 6 of 20
51. (go_north_west b9)
   changed: (x b9) from 13.5 to 12, (y b9) from 53.5 to 55
   goals met: 6 of 20
52. (save_person b9 p15)
   added: (saved p15)
   goals met: 7 of 20
53. (go_north_west b9)
   changed: (x b9) from 12 to 10.5, (y b9) from 55 to 56.5
   goals met: 7 of 20
54. (go_north_west b9)
   changed: (x b9) from 10.5 to 9, (y b9) from 56.5 to 58
   goals met: 7 of 20
55. (go_north_west b9)
   changed: (x b9) from 9 to 7.5, (y b9) from 58 to 59.5
   goals met: 7 of 20
56. (go_north_west b9)
   changed: (x b9) from 7.5 to 6, (y b9) from 59.5 to 61
   goals met: 7 of 20
57. (go_north_west b9)
   changed: (x b9) from 6 to 4.5, (y b9) from 61 to 62.5
   goals met: 7 of 20
58. (go_north_west b9)
   changed: (x b9) from 4.5 to 3, (y b9) from 62.5 to 64
   goals met: 7 of 20
59. (go_north_west b4)
   changed: (x b4) from 5 to 3.5, (y b4) from 3 to 4.5
   goals met: 7 of 20
60. (go_north_west b4)
   changed: (x b4) from 3.5 to 2, (y b4) from 4.5 to 6
   goals met: 7 of 20
61. (go_north_west b4)
   changed: (x b4) from 2 to 0.5, (y b4) from 6 to 7.5
   goals met: 7 of 20
62. (save_person b4 p4)
   added: (saved p4)
   goals met: 8 of 20
63. (go_north_west b9)
   changed: (x b9) from 3 to 1.5, (y b9) from 64 to 65.5
   goals met: 8 of 20
64. (go_north_west b9)
   changed: (x b9) from 1.5 to 0, (y b9) from 65.5 to 67
   goals met: 8 of 20
65. (save_person b9 p2)
   added: (saved p2)
   goals met: 9 of 20
66. (go_north_east b9)
   changed: (x b9) from 0 to 1.5, (y b9) from 67 to 68.5
   goals met: 9 of 20
67. (go_north_west b9)
   changed: (x b9) from 1.5 to 0, (y b9) from 68.5 to 70
   goals met: 9 of 20
68. (save_person b9 p0)
   added: (saved p0)
   goals met: 10 of 20
69. (save_person b9 p7)
   added: (saved p7)
   goals met: 11 of 20
70. (go_north_east b9)
   changed: (x b9) from 0 to 1.5, (y b9) from 70 to 71.5
   goals met: 11 of 20
71. (go_north_east b9)
   changed: (x b9) from 1.5 to 3, (y b9) from 71.5 to 73
   goals met: 11 of 20
72. (go_north_east b9)
   changed: (x b9) from 3 to 4.5, (y b9) from 73 to 74.5
   goals met: 11 of 20
73. (go_north_east b9)
   changed: (x b9) from 4.5 to 6, (y b9) from 74.5 to 76
   goals met: 11 of 20
74. (go_north_east b9)
   changed: (x b9) from 6 to 7.5, (y b9) from 76 to 77.5
   goals met: 11 of 20
75. (go_north_east b9)
   changed: (x b9) from 7.5 to 9, (y b9) from 77.5 to 79
   goals met: 11 of 20
76. (go_north_east b9)
   changed: (x b9) from 9 to 10.5, (y b9) from 79 to 80.5
   goals met: 11 of 20
77. (go_north_west b9)
   changed: (x b9) from 10.5 to 9, (y b9) from 80.5 to 82
   goals met: 11 of 20
78. (save_person b9 p5)
   added: (saved p5)
   goals met: 12 of 20
79. (go_north_west b9)
   changed: (x b9) from 9 to 7.5, (y b9) from 82 to 83.5
   goals met: 12 of 20
80. (go_north_west b9)
   changed: (x b9) from 7.5 to 6, (y b9) from 83.5 to 85
   goals met: 12 of 20
81. (go_north_west b9)
   changed: (x b9) from 6 to 4.5, (y b9) from 85 to 86.5
   goals met: 12 of 20
82. (save_person b9 p8)
   added: (saved p8)
   goals met: 13 of 20
83. (save_person b9 p13)
   added: (saved p13)
   goals met: 14 of 20
84. (go_west b9)
   changed: (x b9) from 4.5 to 1.5
   goals met: 14 of 20
85. (go_west b9)
   changed: (x b9) from 1.5 to -1.5
   goals met: 14 of 20
86. (go_west b9)
   changed: (x b9) from -1.5 to -4.5
   goals met: 14 of 20
87. (go_north_east b9)
   changed: (x b9) from -4.5 to -3, (y b9) from 86.5 to 88
   goals met: 14 of 20
88. (go_north_east b9)
   changed: (x b9) from -3 to -1.5, (y b9) from 88 to 89.5
   goals met: 14 of 20
89. (go_north_east b9)
   changed: (x b9) from -1.5 to 0, (y b9) from 89.5 to 91
   goals met: 14 of 20
90. (save_person b9 p3)
   added: (saved p3)
   goals met: 15 of 20
91. (go_north_east b9)
   changed: (x b9) from 0 to 1.5, (y b9) from 91 to 92.5
   goals met: 15 of 20
92. (go_north_west b9)
   changed: (x b9) from 1.5 to 0, (y b9) from 92.5 to 94
   goals met: 15 of 20
93. (save_person b9 p10)
   added: (saved p10)
   goals met: 16 of 20
94. (go_north_west b9)
   changed: (x b9) from 0 to -1.5, (y b9) from 94 to 95.5
   goals met: 16 of 20
95. (go_north_west b9)
   changed: (x b9) from -1.5 to -3, (y b9) from 95.5 to 97
   goals met: 16 of 20
96. (go_north_east b9)
   changed: (x b9) from -3 to -1.5, (y b9) from 97 to 98.5
   goals met: 16 of 20
97. (go_north_east b9)
   changed: (x b9) from -1.5 to 0, (y b9) from 98.5 to 100
   goals met: 16 of 20
98. (save_person b9 p1)
   added: (saved p1)
   goals met: 17 of 20
99. (go_south_west b9)
   changed: (x b9) from 0 to 2, (y b9) from 100 to 98
   goals met: 17 of 20
100. (go_south_west b9)
   changed: (x b9) from 2 to 4, (y b9) from 98 to 96
   goals met: 17 of 20
101. (go_south_west b9)
   changed: (x b9) from 4 to 6, (y b9) from 96 to 94
   goals met: 17 of 20
102. (go_south_west b9)
   changed: (x b9) from 6 to 8, (y b9) from 94 to 92
   goals met: 17 of 20
103. (go_south_west b9)
   changed: (x b9) from 8 to 10, (y b9) from 92 to 90
   goals met: 17 of 20
104. (go_south_west b9)
   changed: (x b9) from 10 to 12, (y b9) from 90 to 88
   goals met: 17 of 20
105. (go_south_west b9)
   changed: (x b9) from 12 to 14, (y b9) from 88 to 86
   goals met: 17 of 20
106. (go_south_west b9)
   changed: (x b9) from 14 to 16, (y b9) from 86 to 84
   goals met: 17 of 20
107. (go_south_west b9)
   changed: (x b9) from 16 to 18, (y b9) from 84 to 82
   goals met: 17 of 20
108. (go_south_east b9)
   changed: (x b9) from 18 to 16, (y b9) from 82 to 80
   goals met: 17 of 20
109. (go_south_east b9)
   changed: (x b9) from 16 to 14, (y b9) from 80 to 78
   goals met: 17 of 20
110. (go_south_east b9)
   changed: (x b9) from 14 to 12, (y b9) from 78 to 76
   goals met: 17 of 20
111. (go_south_east b9)
   changed: (x b9) from 12 to 10, (y b9) from 76 to 74
   goals met: 17 of 20
112. (go_south_east b9)
   changed: (x b9) from 10 to 8, (y b9) from 74 to 72
   goals met: 17 of 20
113. (go_south_east b9)
   changed: (x b9) from 8 to 6, (y b9) from 72 to 70
   goals met: 17 of 20
114. (go_south_east b9)
   changed: (x b9) from 6 to 4, (y b9) from 70 to 68
   goals met: 17 of 20
115. (go_south_east b9)
   changed: (x b9) from 4 to 2, (y b9) from 68 to 66
   goals met: 17 of 20
116. (go_south_east b9)
   changed: (x b9) from 2 to 0, (y b9) from 66 to 64
   goals met: 17 of 20
117. (go_south b9)
   changed: (y b9) from 64 to 62
   goals met: 17 of 20
118. (save_person b9 p9)
   added: (saved p9)
   goals met: 18 of 20
119. (save_person b9 p14)
   added: (saved p14)
   goals met: 19 of 20
120. (save_person b9 p19)
   added: (saved p19)
   goals met: 20 of 20
